<?php
return [
    'success' => 'تمت العملية بنجاح.',
    'error' => 'حدث خطأ ما. حاول مرة أخرى.',
    'not_found' => 'المورد المطلوب غير موجود.',
    'profile_success' => 'تم جلب الملف الشخصي بنجاح.',
    'unexpected_error' => 'حدث خطأ غير متوقع. حاول مرة أخرى لاحقاً.',

    'auth' => [
        'login_successful' => 'تم تسجيل الدخول بنجاح.',
        'login_failed' => 'فشل تسجيل الدخول. حاول مرة أخرى.',
        'failed' => ' كلمة المرور أو البريد الالكتروني غير صحيح.',

        'token_required' => 'ليس لديك صلاحية . يرجى تسجيل الدخول والمحاولة مرة أخرى.',
        'token_invalid' => 'انتهت صلاحية الجلسة , يرجى تسجيل الدخول مرة اخرى',

        'unauthenticated' => 'غير مصرح لك.',
        'not_authorized' => 'ليس لديك صلاحية ',


    ],

    'validation' => [
        'name_required' => 'حقل الاسم مطلوب.',
        'email_unique' => 'هذا البريد الإلكتروني مستخدم من قبل.',
        'email_required' => 'حقل البريد الإلكتروني مطلوب.',
        'email_invalid' => 'يرجى إدخال بريد إلكتروني صالح.',
        'email_exists' => 'البريد الإلكتروني غير موجود.',

        'password_required' => 'حقل كلمة المرور مطلوب.',
        'password_min' => 'يجب أن تتكون كلمة المرور من 6 أحرف على الأقل.',
        'password_confirmed' => 'تأكيد كلمة المرور غير مطابق.',
        'password_regex' => 'يجب أن تحتوي كلمة المرور على حرف واحد على الأقل ورقم واحد على الأقل.',

        'error_occurred' => 'خطأ في التحقق من البيانات. يرجى مراجعة الإدخال.',

        'error_occurred'    => 'حدث خطأ في التحقق من البيانات.',
        'title_required'    => 'حقل العنوان مطلوب.',
        'title_string'      => 'يجب أن يكون العنوان نصًا.',
        'title_max'         => 'يجب ألا يزيد العنوان عن 255 حرفًا.',

        'content_required'  => 'حقل المحتوى مطلوب.',
        'content_string'    => 'يجب أن يكون المحتوى نصًا.',

        'image_type'        => 'يجب أن يكون الملف صورة.',
        'image_max'         => 'يجب ألا تزيد الصورة عن 2 ميغابايت.',
        'image_reuired'     => 'حقل الصورة مطلوب',

        'comment_required' => 'حقل التعليق مطلوب.',
        'comment_string'   => 'يجب أن يكون التعليق نصًا.',
        'comment_max'      => 'يجب ألا يتجاوز التعليق 1000 حرف.',


    ],

    'posts' => [
        'list_success'   => 'تم جلب المنشورات بنجاح.',
        'created'        => 'تم إنشاء المنشور بنجاح.',
        'updated'        => 'تم تحديث المنشور بنجاح.',
        'deleted'        => 'تم حذف المنشور بنجاح.',
        'unauthorized'   => 'غير مصرح لك بتعديل هذا المنشور.',
        'unauthorized_delete'   => 'غير مصرح لك بحذف هذا المنشور.',
        'show_success' => 'تم استرجاع معلومات المنشور بنجاح',
        'not_found' => 'المنشور غير موجود',
    ],

    'comments' => [
        'created' => 'تم إضافة التعليق بنجاح.',
        'list_success' => 'تم جلب التعليقات بنجاح.',
    ],

    'users' => [
        'created' => 'تم إنشاء المستخدم بنجاح.',
        'updated' => 'تم تحديث المستخدم بنجاح.',
        'list_success' => 'تم جلب المستخدمين بنجاح.',
        'deleted' => 'تم حذف المستخدم بنجاح.',
    ],

    'errors' => [
        'route_not_found' => 'المسار المطلوب غير موجود.',
        'method_not_allowed' => 'طريقة الطلب هذه غير مسموحة لهذا المسار.',
        'unauthenticated' => 'أنت غير مصرح له.',
        'forbidden' => 'ليس لديك إذن للوصول إلى هذا المورد.',
        'validation_failed' => 'فشل التحقق من البيانات.',
        'model_not_found' => 'المورد المطلوب غير موجود.',
        'unexpected_error' => 'حدث خطأ غير متوقع. حاول مرة أخرى لاحقاً.',
    ],

];